ЧартерEDT.Расширение1/src/InformationRegisters/ИсторияОбменовСВнешнимиСистемами/ИсторияОбменовСВнешнимиСистемами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияОбменовСВнешнимиСистемами</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТелоЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоВходящийЗапрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаголовкиЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТелоОтвета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Метаданные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ФорматЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.ВнешниеСистемыОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбмена</name>
    <type>
      <types>CatalogRef.ВидыОбменов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЧартерEDT.Расширение1/src/InformationRegisters/ИсторияОбменовСВнешнимиСистемами/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	                    
	Если ТекущаяСтрока <> Неопределено Тогда
		ЗаполнитьТелоЗапроса(ТекущаяСтрока);	 
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТелоЗапроса(КлючЗаписи)
	
	Запись = РегистрыСведений.ИсторияОбменовСВнешнимиСистемами.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);
	Запись.Прочитать();

	Если Запись.Выбран() Тогда
		
		Если Запись.ФорматЗапроса = "JSON" Тогда		
			ТелоЗапроса = Запись.ТелоЗапроса.Получить();
			ТелоОтвета = Запись.ТелоОтвета.Получить();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
